vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/video/camera/device/mt9m114/fsl_mt9m114.h
/*
 * Copyright 2017-2018, 2020-2021 NXP
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_MT9M114_H_
#define _FSL_MT9M114_H_

#include "fsl_common.h"
#include "fsl_camera_device.h"
#include "fsl_video_i2c.h"

/*
 * Change log:
 *
 *   1.0.2
 *     - Add RAW8 support.
 *
 *   1.0.1
 *     - Fixed MISRA-C 2012 issues.
 *
 *   1.0.0
 *     - Initial version
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define MT9M114_I2C_ADDR 0x48U
#define MT9M114_CHIP_ID  0x2481U

/*! @brief MT9M114 register definitions.*/

/* 1.Core registers */
#define MT9M114_REG_Y_ADDR_START            0x3002U
#define MT9M114_REG_X_ADDR_START            0x3004U
#define MT9M114_REG_Y_ADDR_END              0x3006U
#define MT9M114_REG_X_ADDR_END              0x3008U
#define MT9M114_REG_FRAME_LENGTH_LINES      0x300AU
#define MT9M114_REG_LINE_LENGTH_PCK_        0x300CU
#define MT9M114_REG_COARSE_INTEGRATION_TIME 0x3012U
#define MT9M114_REG_FINE_INTEGRATION_TIME   0x3014U
#define MT9M114_REG_RESET_REGISTER          0x301AU
#define MT9M114_REG_FLASH                   0x3046U
#define MT9M114_REG_FLASH_COUNT             0x3048U
#define MT9M114_REG_GREEN1_GAIN             0x3056U
#define MT9M114_REG_BLUE_GAIN               0x3058U
#define MT9M114_REG_RED_GAIN                0x305AU
#define MT9M114_REG_GREEN2_GAIN             0x305CU
#define MT9M114_REG_GLOBAL_GAIN             0x305EU
#define MT9M114_REG_FUSE_ID1                0x31F4U
#define MT9M114_REG_FUSE_ID2                0x31F6U
#define MT9M114_REG_FUSE_ID3                0x31F8U
#define MT9M114_REG_FUSE_ID4                0x31FAU
#define MT9M114_REG_CHAIN_CONTROL           0x31FCU
#define MT9M114_REG_CUSTOMER_REV            0x31FEU

/* 2.SOC1 registers */
#define MT9M114_REG_COLOR_PIPELINE_CONTROL 0x3210U

/* 3.SOC2 registers */
#define MT9M114_REG_P_G1_P0Q0     0x3640U
#define MT9M114_REG_P_G1_P0Q1     0x3642U
#define MT9M114_REG_P_G1_P0Q2     0x3644U
#define MT9M114_REG_P_G1_P0Q3     0x3646U
#define MT9M114_REG_P_G1_P0Q4     0x3648U
#define MT9M114_REG_P_R_P0Q0      0x364AU
#define MT9M114_REG_P_R_P0Q1      0x364CU
#define MT9M114_REG_P_R_P0Q2      0x364EU
#define MT9M114_REG_P_R_P0Q3      0x3650U
#define MT9M114_REG_P_R_P0Q4      0x3652U
#define MT9M114_REG_P_B_P0Q0      0x3654U
#define MT9M114_REG_P_B_P0Q1      0x3656U
#define MT9M114_REG_P_B_P0Q2      0x3658U
#define MT9M114_REG_P_B_P0Q3      0x365AU
#define MT9M114_REG_P_B_P0Q4      0x365CU
#define MT9M114_REG_P_G2_P0Q0     0x365EU
#define MT9M114_REG_P_G2_P0Q1     0x3660U
#define MT9M114_REG_P_G2_P0Q2     0x3662U
#define MT9M114_REG_P_G2_P0Q3     0x3664U
#define MT9M114_REG_P_G2_P0Q4     0x3666U
#define MT9M114_REG_P_G1_P1Q0     0x3680U
#define MT9M114_REG_P_G1_P1Q1     0x3682U
#define MT9M114_REG_P_G1_P1Q2     0x3684U
#define MT9M114_REG_P_G1_P1Q3     0x3686U
#define MT9M114_REG_P_G1_P1Q4     0x3688U
#define MT9M114_REG_P_R_P1Q0      0x368AU
#define MT9M114_REG_P_R_P1Q1      0x368CU
#define MT9M114_REG_P_R_P1Q2      0x368EU
#define MT9M114_REG_P_R_P1Q3      0x3690U
#define MT9M114_REG_P_R_P1Q4      0x3692U
#define MT9M114_REG_P_B_P1Q0      0x3694U
#define MT9M114_REG_P_B_P1Q1      0x3696U
#define MT9M114_REG_P_B_P1Q2      0x3698U
#define MT9M114_REG_P_B_P1Q3      0x369AU
#define MT9M114_REG_P_B_P1Q4      0x369CU
#define MT9M114_REG_P_G2_P1Q0     0x369EU
#define MT9M114_REG_P_G2_P1Q1     0x36A0U
#define MT9M114_REG_P_G2_P1Q2     0x36A2U
#define MT9M114_REG_P_G2_P1Q3     0x36A4U
#define MT9M114_REG_P_G2_P1Q4     0x36A6U
#define MT9M114_REG_P_G1_P2Q0     0x36C0U
#define MT9M114_REG_P_G1_P2Q1     0x36C2U
#define MT9M114_REG_P_G1_P2Q2     0x36C4U
#define MT9M114_REG_P_G1_P2Q3     0x36C6U
#define MT9M114_REG_P_G1_P2Q4     0x36C8U
#define MT9M114_REG_P_R_P2Q0      0x36CAU
#define MT9M114_REG_P_R_P2Q1      0x36CCU
#define MT9M114_REG_P_R_P2Q2      0x36CEU
#define MT9M114_REG_P_R_P2Q3      0x36D0U
#define MT9M114_REG_P_R_P2Q4      0x36D2U
#define MT9M114_REG_P_B_P2Q0      0x36D4U
#define MT9M114_REG_P_B_P2Q1      0x36D6U
#define MT9M114_REG_P_B_P2Q2      0x36D8U
#define MT9M114_REG_P_B_P2Q3      0x36DAU
#define MT9M114_REG_P_B_P2Q4      0x36DCU
#define MT9M114_REG_P_G2_P2Q0     0x36DEU
#define MT9M114_REG_P_G2_P2Q1     0x36E0U
#define MT9M114_REG_P_G2_P2Q2     0x36E2U
#define MT9M114_REG_P_G2_P2Q3     0x36E4U
#define MT9M114_REG_P_G2_P2Q4     0x36E6U
#define MT9M114_REG_P_G1_P3Q0     0x3700U
#define MT9M114_REG_P_G1_P3Q1     0x3702U
#define MT9M114_REG_P_G1_P3Q2     0x3704U
#define MT9M114_REG_P_G1_P3Q3     0x3706U
#define MT9M114_REG_P_G1_P3Q4     0x3708U
#define MT9M114_REG_P_R_P3Q0      0x370AU
#define MT9M114_REG_P_R_P3Q1      0x370CU
#define MT9M114_REG_P_R_P3Q2      0x370EU
#define MT9M114_REG_P_R_P3Q3      0x3710U
#define MT9M114_REG_P_R_P3Q4      0x3712U
#define MT9M114_REG_P_B_P3Q0      0x3714U
#define MT9M114_REG_P_B_P3Q1      0x3716U
#define MT9M114_REG_P_B_P3Q2      0x3718U
#define MT9M114_REG_P_B_P3Q3      0x371AU
#define MT9M114_REG_P_B_P3Q4      0x371CU
#define MT9M114_REG_P_G2_P3Q0     0x371EU
#define MT9M114_REG_P_G2_P3Q1     0x3720U
#define MT9M114_REG_P_G2_P3Q2     0x3722U
#define MT9M114_REG_P_G2_P3Q3     0x3724U
#define MT9M114_REG_P_G2_P3Q4     0x3726U
#define MT9M114_REG_P_G1_P4Q0     0x3740U
#define MT9M114_REG_P_G1_P4Q1     0x3742U
#define MT9M114_REG_P_G1_P4Q2     0x3744U
#define MT9M114_REG_P_G1_P4Q3     0x3746U
#define MT9M114_REG_P_G1_P4Q4     0x3748U
#define MT9M114_REG_P_R_P4Q0      0x374AU
#define MT9M114_REG_P_R_P4Q1      0x374CU
#define MT9M114_REG_P_R_P4Q2      0x374EU
#define MT9M114_REG_P_R_P4Q3      0x3750U
#define MT9M114_REG_P_R_P4Q4      0x3752U
#define MT9M114_REG_P_B_P4Q0      0x3754U
#define MT9M114_REG_P_B_P4Q1      0x3756U
#define MT9M114_REG_P_B_P4Q2      0x3758U
#define MT9M114_REG_P_B_P4Q3      0x375AU
#define MT9M114_REG_P_B_P4Q4      0x375CU
#define MT9M114_REG_P_G2_P4Q0     0x375EU
#define MT9M114_REG_P_G2_P4Q1     0x3760U
#define MT9M114_REG_P_G2_P4Q2     0x3762U
#define MT9M114_REG_P_G2_P4Q3     0x3764U
#define MT9M114_REG_P_G2_P4Q4     0x3766U
#define MT9M114_REG_CENTER_ROW    0x3782U
#define MT9M114_REG_CENTER_COLUMN 0x3784U

/* 4.SYSCTL registers */
#define MT9M114_REG_CHIP_ID                        0x0000U
#define MT9M114_REG_CLOCKS_CONTROL                 0x0016U
#define MT9M114_REG_RESET_AND_MISC_CONTROL         0x001AU
#define MT9M114_REG_PAD_SLEW                       0x001EU
#define MT9M114_REG_USER_DEFINED_DEVICE_ADDRESS_ID 0x002EU
#define MT9M114_REG_PAD_CONTROL                    0x0032U
#define MT9M114_REG_COMMAND_REGISTER               0x0080U

/* 5.XDMA registers */
#define MT9M114_REG_ACCESS_CTL_STAT         0x0982U
#define MT9M114_REG_PHYSICAL_ADDRESS_ACCESS 0x098AU
#define MT9M114_REG_LOGICAL_ADDRESS_ACCESS  0x098EU
#define MT9M114_REG_MCU_VARIABLE_DATA0      0x0990U
#define MT9M114_REG_MCU_VARIABLE_DATA1      0x0992U
#define MT9M114_REG_MCU_VARIABLE_DATA2      0x0994U
#define MT9M114_REG_MCU_VARIABLE_DATA3      0x0996U
#define MT9M114_REG_MCU_VARIABLE_DATA4      0x0998U
#define MT9M114_REG_MCU_VARIABLE_DATA5      0x099AU
#define MT9M114_REG_MCU_VARIABLE_DATA6      0x099CU
#define MT9M114_REG_MCU_VARIABLE_DATA7      0x099EU

/*! @brief MT9M114 variables definitions.*/

/* 01.Monitor variables */
#define MT9M114_VAR_MON_MAJOR_VERSION   0x8000U
#define MT9M114_VAR_MON_MINOR_VERSION   0x8002U
#define MT9M114_VAR_MON_RELEASE_VERSION 0x8004U
#define MT9M114_VAR_MON_HEARTBEAT       0x8006U

