vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/video/camera/device/mt9m114/fsl_mt9m114.h
/* 02.Sequencer variables */
#define MT9M114_VAR_SEQ_ERROR_CODE 0x8406U

/* 03.AE_Rule variables */
#define MT9M114_VAR_AE_RULE_ALGO                 0xA404U
#define MT9M114_VAR_AE_RULE_AVG_Y_FROM_STATS     0xA406U
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_0_0  0xA407U
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_0_1  0xA408U
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_0_2  0xA409U
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_0_3  0xA40AU
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_0_4  0xA40BU
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_1_0  0xA40CU
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_1_1  0xA40DU
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_1_2  0xA40EU
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_1_3  0xA40FU
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_1_4  0xA410U
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_2_0  0xA411U
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_2_1  0xA412U
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_2_2  0xA413U
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_2_3  0xA414U
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_2_4  0xA415U
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_3_0  0xA416U
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_3_1  0xA417U
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_3_2  0xA418U
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_3_3  0xA419U
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_3_4  0xA41AU
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_4_0  0xA41BU
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_4_1  0xA41CU
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_4_2  0xA41DU
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_4_3  0xA41EU
#define MT9M114_VAR_AE_RULE_AE_WEIGHT_TABLE_4_4  0xA41FU
#define MT9M114_VAR_AE_RULE_AE_ADAPTIVE_STRENGTH 0xA420U

/* 04.AE_Track variables */
#define MT9M114_VAR_AE_TRACK_STATUS                      0xA800U
#define MT9M114_VAR_AE_TRACK_ALGO                        0xA804U
#define MT9M114_VAR_AE_TRACK_TARGET_AVERAGE_LUMA         0xA807U
#define MT9M114_VAR_AE_TRACK_GATE_PERCENTAGE             0xA808U
#define MT9M114_VAR_AE_TRACK_CURRENT_AVERAGE_LUMA        0xA809U
#define MT9M114_VAR_AE_TRACK_AE_TRACKING_DAMPENING_SPEED 0xA80AU
#define MT9M114_VAR_AE_TRACK_AE_DAMPENING_SPEED          0xA80BU
#define MT9M114_VAR_AE_TRACK_SKIP_FRAMES_COUNTER         0xA80DU
#define MT9M114_VAR_AE_TRACK_CURRENT_FLICKER_LINES       0xA80EU
#define MT9M114_VAR_AE_TRACK_FDZONE                      0xA818U
#define MT9M114_VAR_AE_TRACK_ZONE                        0xA81BU
#define MT9M114_VAR_AE_TRACK_FLICKER_LINES_50HZ          0xA826U
#define MT9M114_VAR_AE_TRACK_VIRT_EXPOSURE_LOG           0xA828U
#define MT9M114_VAR_AE_TRACK_MIN_VIRT_EXPOSURE_LOG_ZONE0 0xA82AU
#define MT9M114_VAR_AE_TRACK_MAX_VIRT_EXPOSURE_LOG_ZONE0 0xA82CU
#define MT9M114_VAR_AE_TRACK_MAX_VIRT_EXPOSURE_LOG_ZONE1 0xA82EU
#define MT9M114_VAR_AE_TRACK_VIRT_GAIN                   0xA838U

/* 05.AWB variables */
#define MT9M114_VAR_AWB_STATUS                        0xAC00U
#define MT9M114_VAR_AWB_MODE                          0xAC02U
#define MT9M114_VAR_AWB_R_RATIO_LOWER                 0xAC06U
#define MT9M114_VAR_AWB_R_RATIO_UPPER                 0xAC07U
#define MT9M114_VAR_AWB_B_RATIO_LOWER                 0xAC08U
#define MT9M114_VAR_AWB_B_RATIO_UPPER                 0xAC09U
#define MT9M114_VAR_AWB_R_SCENE_RATIO_LOWER           0xAC0AU
#define MT9M114_VAR_AWB_R_SCENE_RATIO_UPPER           0xAC0BU
#define MT9M114_VAR_AWB_B_SCENE_RATIO_LOWER           0xAC0CU
#define MT9M114_VAR_AWB_B_SCENE_RATIO_UPPER           0xAC0DU
#define MT9M114_VAR_AWB_R_RATIO_PRE_AWB               0xAC0EU
#define MT9M114_VAR_AWB_B_RATIO_PRE_AWB               0xAC0FU
#define MT9M114_VAR_AWB_R_GAIN                        0xAC12U
#define MT9M114_VAR_AWB_B_GAIN                        0xAC14U
#define MT9M114_VAR_AWB_PRE_AWB_RATIOS_TRACKING_SPEED 0xAC16U
#define MT9M114_VAR_AWB_PIXEL_THRESHOLD_COUNT         0xAC18U

/* 06.BlackLevel variables */
#define MT9M114_VAR_BLACKLEVEL_ALGO                  0xB004U
#define MT9M114_VAR_BLACKLEVEL_MAX_BLACK_LEVEL       0xB00CU
#define MT9M114_VAR_BLACKLEVEL_BLACK_LEVEL_DAMPENING 0xB00DU

/* 07.CCM variables */
#define MT9M114_VAR_CCM_ALGO           0xB404U
#define MT9M114_VAR_CCM_0              0xB406U
#define MT9M114_VAR_CCM_1              0xB408U
#define MT9M114_VAR_CCM_2              0xB40AU
#define MT9M114_VAR_CCM_3              0xB40CU
#define MT9M114_VAR_CCM_4              0xB40EU
#define MT9M114_VAR_CCM_5              0xB410U
#define MT9M114_VAR_CCM_6              0xB412U
#define MT9M114_VAR_CCM_7              0xB414U
#define MT9M114_VAR_CCM_8              0xB416U
#define MT9M114_VAR_CCM_LL_DELTA_CCM_0 0xB418U
#define MT9M114_VAR_CCM_LL_DELTA_CCM_1 0xB41AU
#define MT9M114_VAR_CCM_LL_DELTA_CCM_2 0xB41CU
#define MT9M114_VAR_CCM_LL_DELTA_CCM_3 0xB41EU
#define MT9M114_VAR_CCM_LL_DELTA_CCM_4 0xB420U
#define MT9M114_VAR_CCM_LL_DELTA_CCM_5 0xB422U
#define MT9M114_VAR_CCM_LL_DELTA_CCM_6 0xB424U
#define MT9M114_VAR_CCM_LL_DELTA_CCM_7 0xB426U
#define MT9M114_VAR_CCM_LL_DELTA_CCM_8 0xB428U
#define MT9M114_VAR_CCM_DELTA_GAIN     0xB42AU
#define MT9M114_VAR_CCM_DELTA_THRESH   0xB42BU

/* 08.LowLight variables */
#define MT9M114_VAR_LL_MODE                          0xBC02U
#define MT9M114_VAR_LL_ALGO                          0xBC04U
#define MT9M114_VAR_LL_GAMMA_SELECT                  0xBC07U
#define MT9M114_VAR_LL_GAMMA_CONTRAST_CURVE_0        0xBC0AU
#define MT9M114_VAR_LL_GAMMA_CONTRAST_CURVE_1        0xBC0BU
#define MT9M114_VAR_LL_GAMMA_CONTRAST_CURVE_2        0xBC0CU
#define MT9M114_VAR_LL_GAMMA_CONTRAST_CURVE_3        0xBC0DU
#define MT9M114_VAR_LL_GAMMA_CONTRAST_CURVE_4        0xBC0EU
#define MT9M114_VAR_LL_GAMMA_CONTRAST_CURVE_5        0xBC0FU
#define MT9M114_VAR_LL_GAMMA_CONTRAST_CURVE_6        0xBC10U
#define MT9M114_VAR_LL_GAMMA_CONTRAST_CURVE_7        0xBC11U
#define MT9M114_VAR_LL_GAMMA_CONTRAST_CURVE_8        0xBC12U
#define MT9M114_VAR_LL_GAMMA_CONTRAST_CURVE_9        0xBC13U
#define MT9M114_VAR_LL_GAMMA_CONTRAST_CURVE_10       0xBC14U
#define MT9M114_VAR_LL_GAMMA_CONTRAST_CURVE_11       0xBC15U
#define MT9M114_VAR_LL_GAMMA_CONTRAST_CURVE_12       0xBC16U
#define MT9M114_VAR_LL_GAMMA_CONTRAST_CURVE_13       0xBC17U
#define MT9M114_VAR_LL_GAMMA_CONTRAST_CURVE_14       0xBC18U
#define MT9M114_VAR_LL_GAMMA_CONTRAST_CURVE_15       0xBC19U
#define MT9M114_VAR_LL_GAMMA_CONTRAST_CURVE_16       0xBC1AU
#define MT9M114_VAR_LL_GAMMA_CONTRAST_CURVE_17       0xBC1BU
#define MT9M114_VAR_LL_GAMMA_CONTRAST_CURVE_18       0xBC1CU
#define MT9M114_VAR_LL_GAMMA_NRCURVE_0               0xBC1DU
#define MT9M114_VAR_LL_GAMMA_NRCURVE_1               0xBC1EU
#define MT9M114_VAR_LL_GAMMA_NRCURVE_2               0xBC1FU
#define MT9M114_VAR_LL_GAMMA_NRCURVE_3               0xBC20U
#define MT9M114_VAR_LL_GAMMA_NRCURVE_4               0xBC21U
#define MT9M114_VAR_LL_GAMMA_NRCURVE_5               0xBC22U
#define MT9M114_VAR_LL_GAMMA_NRCURVE_6               0xBC23U
#define MT9M114_VAR_LL_GAMMA_NRCURVE_7               0xBC24U
#define MT9M114_VAR_LL_GAMMA_NRCURVE_8               0xBC25U
#define MT9M114_VAR_LL_GAMMA_NRCURVE_9               0xBC26U
#define MT9M114_VAR_LL_GAMMA_NRCURVE_10              0xBC27U
#define MT9M114_VAR_LL_GAMMA_NRCURVE_11              0xBC28U
#define MT9M114_VAR_LL_GAMMA_NRCURVE_12              0xBC29U
#define MT9M114_VAR_LL_GAMMA_NRCURVE_13              0xBC2AU
#define MT9M114_VAR_LL_GAMMA_NRCURVE_14              0xBC2BU
#define MT9M114_VAR_LL_GAMMA_NRCURVE_15              0xBC2CU
#define MT9M114_VAR_LL_GAMMA_NRCURVE_16              0xBC2DU
#define MT9M114_VAR_LL_GAMMA_NRCURVE_17              0xBC2EU
#define MT9M114_VAR_LL_GAMMA_NRCURVE_18              0xBC2FU
#define MT9M114_VAR_LL_BM_PRECISION_BITS             0xBC31U
#define MT9M114_VAR_LL_AVERAGE_LUMA_FADE_TO_BLACK    0xBC3AU
#define MT9M114_VAR_LL_FADE_TO_BLACK_DAMPENING_SPEED 0xBC3CU

/* 09.CameraControl variables */
#define MT9M114_VAR_CAM_SENSOR_CFG_Y_ADDR_START                0xC800U
#define MT9M114_VAR_CAM_SENSOR_CFG_X_ADDR_START                0xC802U
#define MT9M114_VAR_CAM_SENSOR_CFG_Y_ADDR_END                  0xC804U
#define MT9M114_VAR_CAM_SENSOR_CFG_X_ADDR_END                  0xC806U
#define MT9M114_VAR_CAM_SENSOR_CFG_PIXCLK                      0xC808U
#define MT9M114_VAR_CAM_SENSOR_CFG_ROW_SPEED                   0xC80CU
#define MT9M114_VAR_CAM_SENSOR_CFG_FINE_INTEG_TIME_MIN         0xC80EU
#define MT9M114_VAR_CAM_SENSOR_CFG_FINE_INTEG_TIME_MAX         0xC810U
#define MT9M114_VAR_CAM_SENSOR_CFG_FRAME_LENGTH_LINES          0xC812U
#define MT9M114_VAR_CAM_SENSOR_CFG_LINE_LENGTH_PCK             0xC814U
#define MT9M114_VAR_CAM_SENSOR_CFG_FINE_CORRECTION             0xC816U
#define MT9M114_VAR_CAM_SENSOR_CFG_CPIPE_LAST_ROW              0xC818U
#define MT9M114_VAR_CAM_SENSOR_CFG_REG_0_DATA                  0xC826U
#define MT9M114_VAR_CAM_SENSOR_CONTROL_READ_MODE               0xC834U
#define MT9M114_VAR_CAM_SENSOR_CONTROL_ANALOG_GAIN             0xC836U
#define MT9M114_VAR_CAM_SENSOR_CONTROL_VIRT_COLUMN_GAIN        0xC838U
#define MT9M114_VAR_CAM_SENSOR_CONTROL_FRAME_LENGTH_LINES      0xC83AU
#define MT9M114_VAR_CAM_SENSOR_CONTROL_COARSE_INTEGRATION_TIME 0xC83CU
#define MT9M114_VAR_CAM_SENSOR_CONTROL_FINE_INTEGRATION_TIME   0xC83EU
#define MT9M114_VAR_CAM_CPIPE_CONTROL_DGAIN_RED                0xC840U
#define MT9M114_VAR_CAM_CPIPE_CONTROL_DGAIN_GREEN1             0xC842U
#define MT9M114_VAR_CAM_CPIPE_CONTROL_DGAIN_GREEN2             0xC844U
#define MT9M114_VAR_CAM_CPIPE_CONTROL_DGAIN_BLUE               0xC846U
#define MT9M114_VAR_CAM_CPIPE_CONTROL_DGAIN_SECOND             0xC848U
#define MT9M114_VAR_CAM_CPIPE_CONTROL_SECOND_BLACK_LEVEL       0xC84BU
#define MT9M114_VAR_CAM_MODE_SELECT                            0xC84CU
#define MT9M114_VAR_CAM_MODE_TEST_PATTERN_SELECT               0xC84DU
#define MT9M114_VAR_CAM_MODE_TEST_PATTERN_RED                  0xC84EU
#define MT9M114_VAR_CAM_MODE_TEST_PATTERN_GREEN                0xC850U
#define MT9M114_VAR_CAM_MODE_TEST_PATTERN_BLUE                 0xC852U
#define MT9M114_VAR_CAM_CROP_WINDOW_XOFFSET                    0xC854U
#define MT9M114_VAR_CAM_CROP_WINDOW_YOFFSET                    0xC856U
#define MT9M114_VAR_CAM_CROP_WINDOW_WIDTH                      0xC858U
#define MT9M114_VAR_CAM_CROP_WINDOW_HEIGHT                     0xC85AU
#define MT9M114_VAR_CAM_CROP_CROPMODE                          0xC85CU
#define MT9M114_VAR_CAM_SCALE_VERTICAL_TC_MODE                 0xC85EU
#define MT9M114_VAR_CAM_SCALE_VERTICAL_TC_PERCENTAGE           0xC860U
#define MT9M114_VAR_CAM_SCALE_VERTICAL_TC_STRETCH_FACTOR       0xC862U
#define MT9M114_VAR_CAM_OUTPUT_WIDTH                           0xC868U
#define MT9M114_VAR_CAM_OUTPUT_HEIGHT                          0xC86AU
#define MT9M114_VAR_CAM_OUTPUT_FORMAT                          0xC86CU
#define MT9M114_VAR_CAM_OUTPUT_FORMAT_YUV                      0xC86EU
#define MT9M114_VAR_CAM_OUTPUT_Y_OFFSET                        0xC870U
#define MT9M114_VAR_CAM_HUE_ANGLE                              0xC873U
#define MT9M114_VAR_CAM_SFX_CONTROL                            0xC874U
#define MT9M114_VAR_CAM_SFX_SOLARIZATION_THRESH                0xC875U
#define MT9M114_VAR_CAM_SFX_SEPIA_CR                           0xC876U
#define MT9M114_VAR_CAM_SFX_SEPIA_CB                           0xC877U
#define MT9M114_VAR_CAM_AET_AEMODE                             0xC878U
#define MT9M114_VAR_CAM_AET_SKIP_FRAMES                        0xC879U
#define MT9M114_VAR_CAM_AET_TARGET_AVERAGE_LUMA                0xC87AU
#define MT9M114_VAR_CAM_AET_TARGET_AVERAGE_LUMA_DARK           0xC87BU
#define MT9M114_VAR_CAM_AET_BLACK_CLIPPING_TARGET              0xC87CU
#define MT9M114_VAR_CAM_AET_AE_MIN_VIRT_INT_TIME_PCLK          0xC87EU
#define MT9M114_VAR_CAM_AET_AE_MIN_VIRT_DGAIN                  0xC880U
#define MT9M114_VAR_CAM_AET_AE_MAX_VIRT_DGAIN                  0xC882U
#define MT9M114_VAR_CAM_AET_AE_MIN_VIRT_AGAIN                  0xC884U
#define MT9M114_VAR_CAM_AET_AE_MAX_VIRT_AGAIN                  0xC886U
#define MT9M114_VAR_CAM_AET_AE_VIRT_GAIN_TH_EG                 0xC888U
#define MT9M114_VAR_CAM_AET_AE_EG_GATE_PERCENTAGE              0xC88AU
#define MT9M114_VAR_CAM_AET_FLICKER_FREQ_HZ                    0xC88BU
#define MT9M114_VAR_CAM_AET_MAX_FRAME_RATE                     0xC88CU
#define MT9M114_VAR_CAM_AET_MIN_FRAME_RATE                     0xC88EU
#define MT9M114_VAR_CAM_AET_TARGET_GAIN                        0xC890U
#define MT9M114_VAR_CAM_AWB_CCM_L_0                            0xC892U
#define MT9M114_VAR_CAM_AWB_CCM_L_1                            0xC894U
#define MT9M114_VAR_CAM_AWB_CCM_L_2                            0xC896U
#define MT9M114_VAR_CAM_AWB_CCM_L_3                            0xC898U
#define MT9M114_VAR_CAM_AWB_CCM_L_4                            0xC89AU
#define MT9M114_VAR_CAM_AWB_CCM_L_5                            0xC89CU
#define MT9M114_VAR_CAM_AWB_CCM_L_6                            0xC89EU
#define MT9M114_VAR_CAM_AWB_CCM_L_7                            0xC8A0U
#define MT9M114_VAR_CAM_AWB_CCM_L_8                            0xC8A2U
#define MT9M114_VAR_CAM_AWB_CCM_M_0                            0xC8A4U
#define MT9M114_VAR_CAM_AWB_CCM_M_1                            0xC8A6U
#define MT9M114_VAR_CAM_AWB_CCM_M_2                            0xC8A8U
#define MT9M114_VAR_CAM_AWB_CCM_M_3                            0xC8AAU
#define MT9M114_VAR_CAM_AWB_CCM_M_4                            0xC8ACU
#define MT9M114_VAR_CAM_AWB_CCM_M_5                            0xC8AEU
#define MT9M114_VAR_CAM_AWB_CCM_M_6                            0xC8B0U
#define MT9M114_VAR_CAM_AWB_CCM_M_7                            0xC8B2U
#define MT9M114_VAR_CAM_AWB_CCM_M_8                            0xC8B4U
#define MT9M114_VAR_CAM_AWB_CCM_R_0                            0xC8B6U
#define MT9M114_VAR_CAM_AWB_CCM_R_1                            0xC8B8U
#define MT9M114_VAR_CAM_AWB_CCM_R_2                            0xC8BAU
#define MT9M114_VAR_CAM_AWB_CCM_R_3                            0xC8BCU
#define MT9M114_VAR_CAM_AWB_CCM_R_4                            0xC8BEU
#define MT9M114_VAR_CAM_AWB_CCM_R_5                            0xC8C0U
#define MT9M114_VAR_CAM_AWB_CCM_R_6                            0xC8C2U
#define MT9M114_VAR_CAM_AWB_CCM_R_7                            0xC8C4U
#define MT9M114_VAR_CAM_AWB_CCM_R_8                            0xC8C6U
#define MT9M114_VAR_CAM_AWB_CCM_L_RG_GAIN                      0xC8C8U
#define MT9M114_VAR_CAM_AWB_CCM_L_BG_GAIN                      0xC8CAU
#define MT9M114_VAR_CAM_AWB_CCM_M_RG_GAIN                      0xC8CCU
#define MT9M114_VAR_CAM_AWB_CCM_M_BG_GAIN                      0xC8CEU
#define MT9M114_VAR_CAM_AWB_CCM_R_RG_GAIN                      0xC8D0U
#define MT9M114_VAR_CAM_AWB_CCM_R_BG_GAIN                      0xC8D2U
#define MT9M114_VAR_CAM_AWB_CCM_L_CTEMP                        0xC8D4U
#define MT9M114_VAR_CAM_AWB_CCM_M_CTEMP                        0xC8D6U
#define MT9M114_VAR_CAM_AWB_CCM_R_CTEMP                        0xC8D8U
#define MT9M114_VAR_CAM_AWB_LL_CCM_0                           0xC8DAU
#define MT9M114_VAR_CAM_AWB_LL_CCM_1                           0xC8DCU
#define MT9M114_VAR_CAM_AWB_LL_CCM_2                           0xC8DEU
#define MT9M114_VAR_CAM_AWB_LL_CCM_3                           0xC8E0U
#define MT9M114_VAR_CAM_AWB_LL_CCM_4                           0xC8E2U
#define MT9M114_VAR_CAM_AWB_LL_CCM_5                           0xC8E4U
#define MT9M114_VAR_CAM_AWB_LL_CCM_6                           0xC8E6U
#define MT9M114_VAR_CAM_AWB_LL_CCM_7                           0xC8E8U
#define MT9M114_VAR_CAM_AWB_LL_CCM_8                           0xC8EAU
#define MT9M114_VAR_CAM_AWB_COLOR_TEMPERATURE_MIN              0xC8ECU
#define MT9M114_VAR_CAM_AWB_COLOR_TEMPERATURE_MAX              0xC8EEU
#define MT9M114_VAR_CAM_AWB_COLOR_TEMPERATURE                  0xC8F0U
#define MT9M114_VAR_CAM_AWB_AWB_XSCALE                         0xC8F2U
#define MT9M114_VAR_CAM_AWB_AWB_YSCALE                         0xC8F3U
#define MT9M114_VAR_CAM_AWB_AWB_WEIGHTS_0                      0xC8F4U
#define MT9M114_VAR_CAM_AWB_AWB_WEIGHTS_1                      0xC8F6U
#define MT9M114_VAR_CAM_AWB_AWB_WEIGHTS_2                      0xC8F8U
#define MT9M114_VAR_CAM_AWB_AWB_WEIGHTS_3                      0xC8FAU
#define MT9M114_VAR_CAM_AWB_AWB_WEIGHTS_4                      0xC8FCU
#define MT9M114_VAR_CAM_AWB_AWB_WEIGHTS_5                      0xC8FEU
#define MT9M114_VAR_CAM_AWB_AWB_WEIGHTS_6                      0xC900U
#define MT9M114_VAR_CAM_AWB_AWB_WEIGHTS_7                      0xC902U
#define MT9M114_VAR_CAM_AWB_AWB_XSHIFT_PRE_ADJ                 0xC904U
#define MT9M114_VAR_CAM_AWB_AWB_YSHIFT_PRE_ADJ                 0xC906U
#define MT9M114_VAR_CAM_AWB_AWBMODE                            0xC909U
#define MT9M114_VAR_CAM_AWB_TINTS_CTEMP_THRESHOLD              0xC90AU
#define MT9M114_VAR_CAM_AWB_K_R_L                              0xC90CU
#define MT9M114_VAR_CAM_AWB_K_G_L                              0xC90DU
#define MT9M114_VAR_CAM_AWB_K_B_L                              0xC90EU
#define MT9M114_VAR_CAM_AWB_K_R_R                              0xC90FU
#define MT9M114_VAR_CAM_AWB_K_G_R                              0xC910U
#define MT9M114_VAR_CAM_AWB_K_B_R                              0xC911U
#define MT9M114_VAR_CAM_STAT_AWB_CLIP_WINDOW_XSTART            0xC914U
#define MT9M114_VAR_CAM_STAT_AWB_CLIP_WINDOW_YSTART            0xC916U
#define MT9M114_VAR_CAM_STAT_AWB_CLIP_WINDOW_XEND              0xC918U
#define MT9M114_VAR_CAM_STAT_AWB_CLIP_WINDOW_YEND              0xC91AU
#define MT9M114_VAR_CAM_STAT_AE_INITIAL_WINDOW_XSTART          0xC91CU
#define MT9M114_VAR_CAM_STAT_AE_INITIAL_WINDOW_YSTART          0xC91EU
#define MT9M114_VAR_CAM_STAT_AE_INITIAL_WINDOW_XEND            0xC920U
#define MT9M114_VAR_CAM_STAT_AE_INITIAL_WINDOW_YEND            0xC922U
#define MT9M114_VAR_CAM_LL_LLMODE                              0xC924U
#define MT9M114_VAR_CAM_LL_START_BRIGHTNESS                    0xC926U
#define MT9M114_VAR_CAM_LL_STOP_BRIGHTNESS                     0xC928U
#define MT9M114_VAR_CAM_LL_START_SATURATION                    0xC92AU
#define MT9M114_VAR_CAM_LL_END_SATURATION                      0xC92BU
#define MT9M114_VAR_CAM_LL_START_DESATURATION                  0xC92CU
#define MT9M114_VAR_CAM_LL_END_DESATURATION                    0xC92DU
#define MT9M114_VAR_CAM_LL_START_DEMOSAIC                      0xC92EU
#define MT9M114_VAR_CAM_LL_START_AP_GAIN                       0xC92FU
#define MT9M114_VAR_CAM_LL_START_AP_THRESH                     0xC930U
#define MT9M114_VAR_CAM_LL_STOP_DEMOSAIC                       0xC931U
#define MT9M114_VAR_CAM_LL_STOP_AP_GAIN                        0xC932U
#define MT9M114_VAR_CAM_LL_STOP_AP_THRESH                      0xC933U
#define MT9M114_VAR_CAM_LL_START_NR_RED                        0xC934U
#define MT9M114_VAR_CAM_LL_START_NR_GREEN                      0xC935U
#define MT9M114_VAR_CAM_LL_START_NR_BLUE                       0xC936U
#define MT9M114_VAR_CAM_LL_START_NR_THRESH                     0xC937U
#define MT9M114_VAR_CAM_LL_STOP_NR_RED                         0xC938U
#define MT9M114_VAR_CAM_LL_STOP_NR_GREEN                       0xC939U
#define MT9M114_VAR_CAM_LL_STOP_NR_BLUE                        0xC93AU
#define MT9M114_VAR_CAM_LL_STOP_NR_THRESH                      0xC93BU
#define MT9M114_VAR_CAM_LL_START_CONTRAST_BM                   0xC93CU
#define MT9M114_VAR_CAM_LL_STOP_CONTRAST_BM                    0xC93EU
#define MT9M114_VAR_CAM_LL_GAMMA                               0xC940U
#define MT9M114_VAR_CAM_LL_START_CONTRAST_GRADIENT             0xC942U
#define MT9M114_VAR_CAM_LL_STOP_CONTRAST_GRADIENT              0xC943U
#define MT9M114_VAR_CAM_LL_START_CONTRAST_LUMA_PERCENTAGE      0xC944U
#define MT9M114_VAR_CAM_LL_STOP_CONTRAST_LUMA_PERCENTAGE       0xC945U
#define MT9M114_VAR_CAM_LL_START_GAIN_METRIC                   0xC946U
#define MT9M114_VAR_CAM_LL_STOP_GAIN_METRIC                    0xC948U
#define MT9M114_VAR_CAM_LL_START_FADE_TO_BLACK_LUMA            0xC94AU
#define MT9M114_VAR_CAM_LL_STOP_FADE_TO_BLACK_LUMA             0xC94CU
#define MT9M114_VAR_CAM_LL_CLUSTER_DC_TH_BM                    0xC94EU
#define MT9M114_VAR_CAM_LL_CLUSTER_DC_GATE_PERCENTAGE          0xC950U
#define MT9M114_VAR_CAM_LL_SUMMING_SENSITIVITY_FACTOR          0xC951U
#define MT9M114_VAR_CAM_LL_START_TARGET_LUMA_BM                0xC952U
#define MT9M114_VAR_CAM_LL_STOP_TARGET_LUMA_BM                 0xC954U
#define MT9M114_VAR_CAM_LL_INV_BRIGHTNESS_METRIC               0xC956U
#define MT9M114_VAR_CAM_LL_GAIN_METRIC                         0xC958U
#define MT9M114_VAR_CAM_SEQ_UV_COLOR_BOOST                     0xC95AU
#define MT9M114_VAR_CAM_PGA_PGA_CONTROL                        0xC95EU
#define MT9M114_VAR_CAM_PGA_L_CONFIG_COLOUR_TEMP               0xC960U
#define MT9M114_VAR_CAM_PGA_L_CONFIG_GREEN_RED_Q14             0xC962U
#define MT9M114_VAR_CAM_PGA_L_CONFIG_RED_Q14                   0xC964U
#define MT9M114_VAR_CAM_PGA_L_CONFIG_GREEN_BLUE_Q14            0xC966U
#define MT9M114_VAR_CAM_PGA_L_CONFIG_BLUE_Q14                  0xC968U
#define MT9M114_VAR_CAM_PGA_M_CONFIG_COLOUR_TEMP               0xC96AU
#define MT9M114_VAR_CAM_PGA_M_CONFIG_GREEN_RED_Q14             0xC96CU
#define MT9M114_VAR_CAM_PGA_M_CONFIG_RED_Q14                   0xC96EU
#define MT9M114_VAR_CAM_PGA_M_CONFIG_GREEN_BLUE_Q14            0xC970U
#define MT9M114_VAR_CAM_PGA_M_CONFIG_BLUE_Q14                  0xC972U
#define MT9M114_VAR_CAM_PGA_R_CONFIG_COLOUR_TEMP               0xC974U
#define MT9M114_VAR_CAM_PGA_R_CONFIG_GREEN_RED_Q14             0xC976U
#define MT9M114_VAR_CAM_PGA_R_CONFIG_RED_Q14                   0xC978U
#define MT9M114_VAR_CAM_PGA_R_CONFIG_GREEN_BLUE_Q14            0xC97AU
#define MT9M114_VAR_CAM_PGA_R_CONFIG_BLUE_Q14                  0xC97CU
#define MT9M114_VAR_CAM_SYSCTL_PLL_ENABLE                      0xC97EU
#define MT9M114_VAR_CAM_SYSCTL_PLL_DIVIDER_M_N                 0xC980U
#define MT9M114_VAR_CAM_SYSCTL_PLL_DIVIDER_P                   0xC982U
#define MT9M114_VAR_CAM_PORT_OUTPUT_CONTROL                    0xC984U
#define MT9M114_VAR_CAM_PORT_PORCH                             0xC986U
#define MT9M114_VAR_CAM_PORT_MIPI_TIMING_T_HS_ZERO             0xC988U
#define MT9M114_VAR_CAM_PORT_MIPI_TIMING_T_HS_EXIT_HS_TRAIL    0xC98AU
#define MT9M114_VAR_CAM_PORT_MIPI_TIMING_T_CLK_POST_CLK_PRE    0xC98CU
#define MT9M114_VAR_CAM_PORT_MIPI_TIMING_T_CLK_TRAIL_CLK_ZERO  0xC98EU
#define MT9M114_VAR_CAM_PORT_MIPI_TIMING_T_LPX                 0xC990U
#define MT9M114_VAR_CAM_PORT_MIPI_TIMING_INIT_TIMING           0xC992U

