vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/video/camera/device/mt9m114/fsl_mt9m114.h
/* 10.UVC_Control variables */
#define MT9M114_VAR_UVC_AE_MODE_CONTROL                        0xCC00U
#define MT9M114_VAR_UVC_WHITE_BALANCE_TEMPERATURE_AUTO_CONTROL 0xCC01U
#define MT9M114_VAR_UVC_AE_PRIORITY_CONTROL                    0xCC02U
#define MT9M114_VAR_UVC_POWER_LINE_FREQUENCY_CONTROL           0xCC03U
#define MT9M114_VAR_UVC_EXPOSURE_TIME_ABSOLUTE_CONTROL         0xCC04U
#define MT9M114_VAR_UVC_BACKLIGHT_COMPENSATION_CONTROL         0xCC08U
#define MT9M114_VAR_UVC_BRIGHTNESS_CONTROL                     0xCC0AU
#define MT9M114_VAR_UVC_CONTRAST_CONTROL                       0xCC0CU
#define MT9M114_VAR_UVC_GAIN_CONTROL                           0xCC0EU
#define MT9M114_VAR_UVC_HUE_CONTROL                            0xCC10U
#define MT9M114_VAR_UVC_SATURATION_CONTROL                     0xCC12U
#define MT9M114_VAR_UVC_SHARPNESS_CONTROL                      0xCC14U
#define MT9M114_VAR_UVC_GAMMA_CONTROL                          0xCC16U
#define MT9M114_VAR_UVC_WHITE_BALANCE_TEMPERATURE_CONTROL      0xCC18U
#define MT9M114_VAR_UVC_FRAME_INTERVAL_CONTROL                 0xCC1CU
#define MT9M114_VAR_UVC_MANUAL_EXPOSURE_CONFIGURATION          0xCC20U
#define MT9M114_VAR_UVC_FLICKER_AVOIDANCE_CONFIGURATION        0xCC21U
#define MT9M114_VAR_UVC_ALGO                                   0xCC22U
#define MT9M114_VAR_UVC_RESULT_STATUS                          0xCC24U

/* 11.SystemManager variables */
#define MT9M114_VAR_SYSMGR_NEXT_STATE    0xDC00U
#define MT9M114_VAR_SYSMGR_CURRENT_STATE 0xDC01U
#define MT9M114_VAR_SYSMGR_CMD_STATUS    0xDC02U

/* 12.PatchLoader variables */
#define MT9M114_VAR_PATCHLDR_LOADER_ADDRESS 0xE000U
#define MT9M114_VAR_PATCHLDR_PATCH_ID       0xE002U
#define MT9M114_VAR_PATCHLDR_FIRMWARE_ID    0xE004U
#define MT9M114_VAR_PATCHLDR_APPLY_STATUS   0xE008U
#define MT9M114_VAR_PATCHLDR_NUM_PATCHES    0xE009U
#define MT9M114_VAR_PATCHLDR_PATCH_ID_0     0xE00AU
#define MT9M114_VAR_PATCHLDR_PATCH_ID_1     0xE00CU
#define MT9M114_VAR_PATCHLDR_PATCH_ID_2     0xE00EU
#define MT9M114_VAR_PATCHLDR_PATCH_ID_3     0xE010U
#define MT9M114_VAR_PATCHLDR_PATCH_ID_4     0xE012U
#define MT9M114_VAR_PATCHLDR_PATCH_ID_5     0xE014U
#define MT9M114_VAR_PATCHLDR_PATCH_ID_6     0xE016U
#define MT9M114_VAR_PATCHLDR_PATCH_ID_7     0xE018U

/* 13.Patch variables */
#define MT9M114_VAR_PATCHVARS_DELTA_DK_CORRECTION_FACTOR 0xE400U

/* 14.CommandHandler variables */
#define MT9M114_VAR_CMD_HANDLER_WAIT_EVENT_ID 0xFC00U
#define MT9M114_VAR_CMD_HANDLER_NUM_EVENTS    0xFC02U

/*! @brief MT9M114 command definitions. */
#define MT9M114_COMMAND_APPLY_PATCH    0x0001U
#define MT9M114_COMMAND_SET_STATE      0x0002U
#define MT9M114_COMMAND_REFRESH        0x0004U
#define MT9M114_COMMAND_WAIT_FOR_EVENT 0x0008U
#define MT9M114_COMMAND_OK             0x8000U

/*! @brief MT9M114 system state definitions. */
#define MT9M114_SYS_STATE_ENTER_CONFIG_CHANGE 0x28U
#define MT9M114_SYS_STATE_STREAMING           0x31U
#define MT9M114_SYS_STATE_START_STREAMING     0x34U
#define MT9M114_SYS_STATE_ENTER_SUSPEND       0x40U
#define MT9M114_SYS_STATE_SUSPENDED           0x41U
#define MT9M114_SYS_STATE_ENTER_STANDBY       0x50U
#define MT9M114_SYS_STATE_STANDBY             0x52U
#define MT9M114_SYS_STATE_LEAVE_STANDBY       0x54U

/*! @brief MT9M114 system set-state command retults. */
#define MT9M114_SYS_STATE_SET_RESULT_ENOERR 0x00U /* command successful */
#define MT9M114_SYS_STATE_SET_RESULTEINVAL  0x0CU /* invalid configuration */
#define MT9M114_SYS_STATE_SET_RESULTENOSPC  0x0DU /* resource not available */

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*!
 * @brief MT9M114 resource.
 *
 * Before initialize the MT9M114, the resource must be initialized that the
 * Two-Wire-Serial-Interface I2C could start to work.
 */
typedef struct _mt9m114_resource
{
    video_i2c_send_func_t i2cSendFunc;       /*!< I2C send function. */
    video_i2c_receive_func_t i2cReceiveFunc; /*!< I2C receive function. */
    void (*pullResetPin)(bool pullUp);       /*!< Function to pull reset pin high or low. */
    uint32_t inputClockFreq_Hz;              /*!< Input clock frequency, EXTCLK. */
} mt9m114_resource_t;

/*! @brief MT9M114 operation functions. */
extern const camera_device_operations_t mt9m114_ops;

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

#if defined(__cplusplus)
}
#endif

#endif /* _FSL_MT9M114_H_ */
